{
  "vocab_size": 201088,
  "model_max_length": 131072,
  "padding_side": "left",
  "use_harmony_format": true,
  "special_tokens": {
    "<|start|>": 200000,
    "<|end|>": 200001,
    "<|pad|>": 200002,
    "<|message|>": 200003,
    "<|system|>": 200004,
    "<|developer|>": 200005,
    "<|user|>": 200006,
    "<|assistant|>": 200007,
    "<|tool|>": 200008,
    "<|channel|>": 200009,
    "<|thinking|>": 200010,
    "<|output|>": 200011
  }
}